Tekla.Structures.Model.Part
The Part class represents a part in the model.
A part can be either a beam, a polybeam or a contour plate.

Tekla.Structures.Model.Part.Profile
Gets or sets the profile of the part.

Tekla.Structures.Model.Part.Material
Gets or sets the material the part is made of.

Tekla.Structures.Model.Part.DeformingData
Gets or sets the deforming data of the part.

Tekla.Structures.Model.Part.PartNumber
Gets or sets the part number.
Defines the numbering in the part sense.

Tekla.Structures.Model.Part.AssemblyNumber
Gets or sets the assembly number.
Defines the numbering in the assembly sense.

Tekla.Structures.Model.Part.Name
Gets or sets the name of the part.

Tekla.Structures.Model.Part.Class
Gets or sets the class of the part.

Tekla.Structures.Model.Part.Finish
Gets or sets the finish of the part.

Tekla.Structures.Model.Part.CastUnitType
Gets or sets the cast unit type of the part.

Tekla.Structures.Model.Part.PourPhase
Gets or sets the pour phase of the part.

Tekla.Structures.Model.Part.Position
Gets or sets the part position.
Defines the way the part is positioned in the model.

Tekla.Structures.Model.Part.#ctor
Initializes a new instance of the Tekla.Structures.Model.Part class with default attributes.
The default values are set as follows:
Position = new Position();
Profile = new Profile();
Material = new Material();
DeformingData = new DeformingData();
Name = "";
Class = "";
Finish = "";
PartNumber = new NumberingSeries("P", 1);
AssemblyNumber = new NumberingSeries("A", 1);
CastUnitType = CastUnitTypeEnum.PRECAST;

Tekla.Structures.Model.Part.GetSolid
Returns the solid of the part.
Returns: The solid of the part.

Tekla.Structures.Model.Part.GetSolid(Tekla.Structures.Model.Solid.SolidCreationTypeEnum)
Returns the solid of the part.
solidCreationType: The type to be used in solid creation.
Returns: The solid of the part.

Tekla.Structures.Model.Part.GetSolid(Tekla.Structures.Forming.FormingStates)
Returns the solid of the part.
formingStates: Solid forming information.
Returns: The solid of the part.

Tekla.Structures.Model.Part.GetAssembly
Returns the assembly that the part belongs to.
Returns: The assembly that the part belongs to.

Tekla.Structures.Model.Part.GetPartMark
Returns the part mark.
Returns: A string with the part mark.

Tekla.Structures.Model.Part.GetCenterLine(System.Boolean)
Returns the center line for the given part.
withCutsFittings: Defines if the center line is created from a solid with cuts and fittings or not.
Returns: A list of points that define the center line for the given part.

Tekla.Structures.Model.Part.GetReferenceLine(System.Boolean)
Returns the reference line for the given part.
withCutsFittings: Defines if the reference line is created from a solid with cuts and fittings or not.
Returns: A list of points that define the reference line for the given part.

Tekla.Structures.Model.Part.GetComponents
Returns an enumerator of all the connected components, connections,
seams and details inherited from the base component.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetBooleans
Returns an enumerator of all the connected boolean objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetBolts
Returns an enumerator of all the connected bolts.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetWelds
Returns an enumerator of all the connected welds.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetReinforcements
Returns an enumerator of all the connected reinforcements.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetSurfaceTreatments
Returns an enumerator of all the connected surface treatments.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetSurfaceObjects
Returns an enumerator of all the connected surface objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.GetPours
Returns an enumerator of all the pours that the part belongs to.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Part.CompareTo(Tekla.Structures.Model.Part)
Compares the instantiated part with another one.
partToCompare: The part to compare with.
Returns: True if there are no differences, false otherwise.
Remarks:
If the numbering hasn't been performed the function will also return false.

Tekla.Structures.Model.Part.GetDSTVCoordinateSystem
Get DSTV coordinate system.
Returns: The NC-DSTV coordinate system of the part on success, otherwise null.

Tekla.Structures.Model.Part.CompareToPart(System.Int32)
Compares the parts with id.
partToCompareId: Part id to compare with.
Returns: True if there are no differences, false otherwise.

Tekla.Structures.Model.Part.ToStruct(Tekla.Structures.ModelInternal.dotPart_t@)
Method for transforming the Part's data into corresponding struct.
p: Reference to the struct which will be populated.

Tekla.Structures.Model.Part.FromStruct(Tekla.Structures.ModelInternal.dotPart_t@)
Method for transforming the struct data to corresponding Part data.
p: Reference to the struct which will be used to populate the Part's data.